### **Show Users**

In [ ]:
# SELECT User, Host FROM mysql.user;

### **Show Databases**

In [ ]:
# show databases;

### **Select Database**

In [ ]:
# use database_name;

### **Create Database**

In [ ]:
# create database database_name;

### **Drop Database**

In [ ]:
# drop database database_name;

### **Backup Database**

In [ ]:
# BACKUP DATABASE databasename
# TO DISK = 'filepath';

In [ ]:
# BACKUP DATABASE databasename
# TO DISK = 'filepath'
# WITH DIFFERENTIAL;

#A differential back up only backs up the parts of the database that have changed since the last full database backup.

### **Show Tables**

In [ ]:
# show tables;

### **Show Table's structure**

In [ ]:
# describe table_name;

### **List all columns from a given table**

In [1]:
# show columns from table_name;

### **Create Table**

In [ ]:
# create table table_name       create table employee
# ( col1 dtype1,                 (id int,
#   col2 dtype2,                  name varchar(20),
#   col3 dtype3                   city varchar(25)
# );                           );

In [ ]:
# creating table using another table

# create table new_table_name as
# select col1, col2 from existing_table where cond

### **Delete/Truncate/Drop Table**

In [ ]:
# delete from table_name;                it temporarily delete all the records from the table. if we roll back, we will get the data.
#                                        The structure of table is preserved.

# truncate table table_name;             it permanently deletes all the records from the table. if we roll back we won't get the data.
#                                        But it will not delete the table structure.

# drop table table_name;                 it permanently deletes all the records from the table and completly destroy the str of the table from the database.

### **Deleting a single Record**

In [ ]:
# delete from employees where id=6;

### **Insert a single Record**

In [ ]:
# insert into table_name(col1,col2,col3,...)
# values(val1,val2,val3,...);


#if we r adding values for all the columns of the table then u don't need to specify the column names:
# insert into table_name
# values(val1,val2,val3,...);

In [ ]:
# INSERT INTO users (first_name, last_name, email, password, location, dept, is_admin, register_date)
# values ('Brad', 'Traversy', 'brad@gmail.com', '123456','Massachusetts', 'development', 1, now());

### **Insert Multiple Records**

In [ ]:
# INSERT INTO users (first_name, last_name, email, password, location, dept,  is_admin, register_date)
#  values ('Fred', 'Smith', 'fred@gmail.com', '123456', 'New York', 'design', 0, now()), 
#  ('Sara', 'Watson', 'sara@gmail.com', '123456', 'New York', 'design', 0, now()),
#  ('Will', 'Jackson', 'will@yahoo.com', '123456', 'Rhode Island', 'development', 1, now()),
#  ('Paula', 'Johnson', 'paula@yahoo.com', '123456', 'Massachusetts', 'sales', 0, now()),
#  ('Tom', 'Spears', 'tom@yahoo.com', '123456', 'Massachusetts', 'sales', 0, now());

### **Updating a Record**

In [ ]:
# update table_name
# set col1=val1, col2=val2,....
# where cond;

# UPDATE users 
# SET email = 'freddy@gmail.com' 
# WHERE id = 2;

### **Select Table**

In [ ]:
# select * from Table_name;

### **Select a Record**

In [ ]:
# select * from table_name where id =6;

### **Add new Column**

In [ ]:
# alter table table_name
# add column_name dtype;

# ALTER TABLE users 
# ADD age VARCHAR(3);

### **Drop Column**

In [ ]:
# alter table table_name
# drop column column_name;

# ALTER TABLE users 
# drop column age;

### **Modify Column**

In [ ]:
#alter table table_name
#modify column column_name new_dtype;

# ALTER TABLE users
# MODIFY COLUMN age INT(3);

### **Views**

In [ ]:
# CREATE VIEW view_name AS
# SELECT column1, column2, ...
# FROM table_name
# WHERE condition;

In [ ]:
#DROP VIEW view_name;

### **MySQL Functions**

In [ ]:
#TRUNCATE:	Truncates a number to the specified number of decimal places

#SELECT TRUNCATE(135.375, 2);

In [ ]:
#ROUND:	Rounds a number to a specified number of decimal places

#select round(LONG_W,4) from STATION where LAT_N<137.2345;

In [ ]:
#ABS:	Returns the absolute value of a number

#Manhattan Distance between points p1(x1,y1) and p2(x2,y2) and round it to a scale of  decimal places.
#select round(abs(max(LAT_N)-min(LAT_N))+abs(max(LONG_W)-min(LONG_W)),4) from STATION

In [ ]:
#POW:	Returns the value of a number raised to the power of another number

In [ ]:
#SQRT:	Returns the square root of a number

In [ ]:
#Euclidean Distance
# select truncate(sqrt(pow((min( LAT_N) - max( LAT_N)),2) + pow((min(LONG_W) - max(LONG_W)),2)),4) from STATION

In [ ]:
#REPLACE:	Replaces all occurrences of a substring within a string, with a new substring

# select avg(replace(salary,'0','')) from Employees;
# select replace('sourav kamboj','o','$')

In [ ]:
#SUBSTR:	Extracts a substring from a string (starting at any position)

#Extract a substring from a string (start at position 5th from last, extract 2 characters):
# select name from STUDENTS where marks>75 order by substr(name,-5,2) asc, ID asc;

In [1]:
#REPEAT:	Repeats a string as many times as specified

# select repeat('*',5)